In [1]:
import pandas as pd

In [6]:
df=pd.read_csv("supermarket_sales new.csv")
df.head()

,Gender,Invoice ID,Branch,City,Customer type,Product line,Unit price,Quantity,Tax 5%
0,Female,750-67-8428,A,Yangon,Member,Health and beauty,74.69,7,261.415
1,Female,226-31-3081,C,Naypyitaw,Normal,Electronic accessories,15.28,5,3.820
2,Female,355-53-5943,A,Yangon,Member,Electronic accessories,68.84,6,20.652
3,Female,315-22-5665,C,Naypyitaw,Normal,Home and lifestyle,73.56,10,36.780
4,Female,665-32-9167,A,Yangon,Member,Health and beauty,36.26,2,3.626

In [7]:
df.size

9000

In [8]:
df.shape

(1000, 9)

In [9]:
df.duplicated().sum()

0

In [11]:
df.describe()

        Unit price     Quantity       Tax 5%
count  1000.000000  1000.000000  1000.000000
mean     55.672130     5.510000    43.911392
std      26.494628     2.923431   100.551612
min      10.080000     1.000000     1.066000
25%      32.875000     3.000000     6.222500
50%      55.230000     5.000000    12.404000
75%      77.935000     8.000000    27.226250
max      99.960000    10.000000   985.000000

In [12]:
df.describe(include = "object")

        Gender   Invoice ID Branch    City Customer type         Product line
count     1000         1000   1000    1000          1000                 1000
unique       2         1000      3       3             2                    6
top     Female  750-67-8428      A  Yangon        Member  Fashion accessories
freq       501            1    340     340           501                  178

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Gender         1000 non-null   object
 1   Invoice ID     1000 non-null   object
 2   Branch         1000 non-null   object
 3   City           1000 non-null   object
 4   Customer type  1000 non-null   object
 5   Product line   1000 non-null   object
 6   Unit price     1000 non-null   float64
 7   Quantity       1000 non-null   int64
 8   Tax 5%         1000 non-null   float64
dtypes: float64(2), int64(1), object(6)
memory usage: 70.4+ KB

In [15]:
df.columns

Index(['Gender', 'Invoice ID', 'Branch', 'City', 'Customer type',
       'Product line', 'Unit price', 'Quantity', 'Tax 5%'],
      dtype='object')

In [18]:
df.loc[:,"Revenue"] = (df['Unit price'] * df['Quantity']) - df['Tax 5%']

In [19]:
df.head()

,Gender,Invoice ID,Branch,City,Customer type,Product line,Unit price,Quantity,Tax 5%,Revenue
0,Female,750-67-8428,A,Yangon,Member,Health and beauty,74.69,7,261.415,261.415
1,Female,226-31-3081,C,Naypyitaw,Normal,Electronic accessories,15.28,5,3.820,72.580
2,Female,355-53-5943,A,Yangon,Member,Electronic accessories,68.84,6,20.652,392.388
3,Female,315-22-5665,C,Naypyitaw,Normal,Home and lifestyle,73.56,10,36.780,698.820
4,Female,665-32-9167,A,Yangon,Member,Health and beauty,36.26,2,3.626,68.894